In [2]:
import pandas as pd
import numpy as np

###`Q-1:` Write a program to create an empty series.

In [3]:
# code here
df=pd.Series()
df

Series([], dtype: object)

###`Q-2:` Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

In [4]:
# code here
df1=pd.Series([10,20,30])
df2=pd.Series([50,60,70])
print(df1+df2)
print("_______________")
print(df1-df2)
print("_______________")
print(df1*df2)
print("_______________")
print(df1/df2)
print("_______________")

0     60
1     80
2    100
dtype: int64
_______________
0   -40
1   -40
2   -40
dtype: int64
_______________
0     500
1    1200
2    2100
dtype: int64
_______________
0    0.200000
1    0.333333
2    0.428571
dtype: float64
_______________

###`Q-3` Write a Pandas program to compare the elements of the two Pandas Series.
Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 10]

In [5]:
# code here
df=pd.Series([2, 4, 6, 8, 10])
df1=pd.Series([1, 3, 5, 7, 10])
df-df1

0    1
1    1
2    1
3    1
4    0
dtype: int64

###`Q-5.`Write a function to change the data type of given a column or a Series. Function takes series and data type as input, returns the converted series.
```
series = pd.Series([1,2,'Python', 2.0, True, 100])
change to float type data
```
Note: Read about pd.to_numeric()

In [14]:
# code here

def change_the_float_dtype(series,dtype):
    df=pd.Series(series)
    return pd.to_numeric(df,errors='coerce',downcast=dtype)
series = pd.Series([1,2,'Python', 2.0, True, 100])
dtype="float"
change_the_float_dtype(series,dtype)

0      1.0
1      2.0
2      NaN
3      2.0
4      1.0
5    100.0
dtype: float32

Download data - https://drive.google.com/file/d/1LRhXwbEodeWXtzPhJCX0X9Lf_BECzvqb/view?usp=share_link
All Batsman runs series in IPL 2008 to 2022.

Below questions are based on this data.

###`Q-6` Find top 10 most run getter from the series.

In [28]:
# code here
df=pd.read_csv("batsman_runs_series.csv",index_col="batter")
df.head()
df.size

605

In [23]:
df.sort_values(by="batsman_run",ascending=False).head(10)

                batsman_run
batter
V Kohli                6634
S Dhawan               6244
DA Warner              5883
RG Sharma              5881
SK Raina               5536
AB de Villiers         5181
CH Gayle               4997
MS Dhoni               4978
RV Uthappa             4954
KD Karthik             4377

###`Q-7` No of players having runs above 3000

In [30]:
# code here
len(df[df["batsman_run"]< 3000])

585

###`Q-8` No of players having runs above mean value?

In [41]:
# code here
df[df.values < df.values.mean()].count()

batsman_run    477
dtype: int64

Download data - https://drive.google.com/file/d/1QZuZ5bypUInfVvarHACLAi8tXXHvb8xd/view?usp=share_link

file name - items.csv

###`Q-9`
    i. Read `items.csv` making `item_name` as index.
    ii. Show no of nan values
    ii. Item price is given in $, so convert it to rupees without currency symbol.
    iii. Make data type of newly made series as float.
    iv. Fill nan with mean of the series


How csv file looks

```
item_name	item_price
Chips and Fresh Tomato Salsa	$2.39
Izze	$3.39
Nantucket Nectar	$3.39
Chips and Tomatillo-Green Chili Salsa	$2.39
Chicken Bowl	$16.98

```

In [ ]:
# code here

###`Q-10`:
    i. Find mean price
    ii. Find 30th and 6th percentile value
    iii. Plot Histogram on price with bin size 50
    iv. No of items price lies between [1000 to 2000]

In [ ]:
# code here